In [8]:
import pandas as pd
import numpy as np

In [9]:
mylist = [5.4,6.1,1.7,99.8]
myseries1 = pd.Series(mylist)
myarray = np.array(data = mylist)

In [4]:
myseries1

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [10]:
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [11]:
print(myseries1[2])

1.7

In [12]:
mylabels = ['first','second','third','fourth']

In [13]:
myseries3 = pd.Series(data=mylist,index=mylabels)

In [15]:
temp = pd.Series(mylabels,mylist)

In [16]:
myseries3

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [17]:
temp

5.4      first
6.1     second
1.7      third
99.8    fourth
dtype: object

In [18]:
myseries4 = pd.Series(mylist,mylabels)
print(myseries4['second'])

6.1

In [20]:
myseries4

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [19]:
myseries5 = pd.Series([5.5,1.1,8.8,1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.9
fourth    108.6
second      NaN
third       2.8
dtype: float64

In [30]:
df1 = pd.concat([myseries4,myseries5],axis=1,sort=False)
df1.columns = ['series4','series5']

In [31]:
df1

        series4  series5
first       5.4      5.5
second      6.1      NaN
third       1.7      1.1
fourth     99.8      8.8
fifth       NaN      1.6

In [32]:
df2 = pd.concat([myseries4,myseries5],axis=0,sort=False)
df2.columns = ['series4','series5']

In [33]:
df2

first      5.4
second     6.1
third      1.7
fourth    99.8
first      5.5
third      1.1
fourth     8.8
fifth      1.6
dtype: float64

In [34]:
df3 = pd.DataFrame(np.random.randn(5,5))
df3

          0         1         2         3         4
0 -2.031187 -1.234556 -0.796590  0.391679 -0.077389
1  1.353885  1.121878 -0.166917  0.481624 -0.398749
2  0.482813  0.054582 -0.811258  0.958225 -0.777398
3  0.115038 -0.629958  0.653590  0.242763 -0.670090
4 -0.082750  1.221765 -1.368568  0.126231 -1.054583

In [35]:
df4 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df4

            first col  second col  third col  fourth col  fifth col
first row   -3.075684    0.019490   0.632669   -0.343938  -0.498723
second row  -0.935237   -0.933809  -0.582264    0.625252   2.097612
third row    0.160734   -0.093593   0.741650   -0.854001   0.842118
fourth row   0.107964   -0.850493   0.800470   -2.008947  -1.187297
fifth row   -0.354099    0.314050  -0.154098   -0.253282  -0.905114

In [37]:
print(df4['second col'])
print('')
df4[['third col','first col']]

first row     0.019490
second row   -0.933809
third row    -0.093593
fourth row   -0.850493
fifth row     0.314050
Name: second col, dtype: float64

            third col  first col
first row    0.632669  -3.075684
second row  -0.582264  -0.935237
third row    0.741650   0.160734
fourth row   0.800470   0.107964
fifth row   -0.154098  -0.354099

In [39]:
df4.loc['fourth row']

first col     0.107964
second col   -0.850493
third col     0.800470
fourth col   -2.008947
fifth col    -1.187297
Name: fourth row, dtype: float64

In [40]:
df4.loc[df4['first col']<-0.855281]

            first col  second col  third col  fourth col  fifth col
first row   -3.075684    0.019490   0.632669   -0.343938  -0.498723
second row  -0.935237   -0.933809  -0.582264    0.625252   2.097612

In [41]:
df4['third col'].loc['third row']

0.7416500641297219

In [43]:
df4.iloc[2] # iloc = index location 2

first col     0.160734
second col   -0.093593
third col     0.741650
fourth col   -0.854001
fifth col     0.842118
Name: third row, dtype: float64

In [44]:
df4>0

            first col  second col  third col  fourth col  fifth col
first row       False        True       True       False      False
second row      False       False      False        True       True
third row        True       False       True       False       True
fourth row       True       False       True       False      False
fifth row       False        True      False       False      False

In [45]:
df4[df4>0]

            first col  second col  third col  fourth col  fifth col
first row         NaN     0.01949   0.632669         NaN        NaN
second row        NaN         NaN        NaN    0.625252   2.097612
third row    0.160734         NaN   0.741650         NaN   0.842118
fourth row   0.107964         NaN   0.800470         NaN        NaN
fifth row         NaN     0.31405        NaN         NaN        NaN

In [48]:
df4['sixth col'] = np.random.randn(5,1) #number of rows of exisitng df i.e df3(5) = number of rows of random matrix (5)
df4

            first col  second col  third col  fourth col  fifth col  sixth col
first row   -3.075684    0.019490   0.632669   -0.343938  -0.498723   1.965150
second row  -0.935237   -0.933809  -0.582264    0.625252   2.097612   1.273879
third row    0.160734   -0.093593   0.741650   -0.854001   0.842118   0.218802
fourth row   0.107964   -0.850493   0.800470   -2.008947  -1.187297   0.319317
fifth row   -0.354099    0.314050  -0.154098   -0.253282  -0.905114  -0.656227

In [49]:
df4.drop('first col',axis=1)

            second col  third col  fourth col  fifth col  sixth col
first row     0.019490   0.632669   -0.343938  -0.498723   1.965150
second row   -0.933809  -0.582264    0.625252   2.097612   1.273879
third row    -0.093593   0.741650   -0.854001   0.842118   0.218802
fourth row   -0.850493   0.800470   -2.008947  -1.187297   0.319317
fifth row     0.314050  -0.154098   -0.253282  -0.905114  -0.656227

In [50]:
df4

            first col  second col  third col  fourth col  fifth col  sixth col
first row   -3.075684    0.019490   0.632669   -0.343938  -0.498723   1.965150
second row  -0.935237   -0.933809  -0.582264    0.625252   2.097612   1.273879
third row    0.160734   -0.093593   0.741650   -0.854001   0.842118   0.218802
fourth row   0.107964   -0.850493   0.800470   -2.008947  -1.187297   0.319317
fifth row   -0.354099    0.314050  -0.154098   -0.253282  -0.905114  -0.656227

In [51]:
# df4 = df4.drop('first col',axis=1)
df4.drop('first col',axis=1,inplace =True)

In [52]:
df4 = df4.drop('second row',axis=0)
df4

            second col  third col  fourth col  fifth col  sixth col
first row     0.019490   0.632669   -0.343938  -0.498723   1.965150
third row    -0.093593   0.741650   -0.854001   0.842118   0.218802
fourth row   -0.850493   0.800470   -2.008947  -1.187297   0.319317
fifth row     0.314050  -0.154098   -0.253282  -0.905114  -0.656227

In [54]:
df4.reset_index()

        index  second col  third col  fourth col  fifth col  sixth col
0   first row    0.019490   0.632669   -0.343938  -0.498723   1.965150
1   third row   -0.093593   0.741650   -0.854001   0.842118   0.218802
2  fourth row   -0.850493   0.800470   -2.008947  -1.187297   0.319317
3   fifth row    0.314050  -0.154098   -0.253282  -0.905114  -0.656227

In [61]:
df4.reset_index(inplace = True)

In [62]:
df4.columns

Index(['index', 'second col', 'third col', 'fourth col', 'fifth col',
       'sixth col'],
      dtype='object')

In [64]:
x = df4.columns
x[0]

'index'

In [65]:
df4['new name'] = ['This','is','the','row']
df4

,index,second col,third col,fourth col,fifth col,sixth col,new name
0,first row,0.019490,0.632669,-0.343938,-0.498723,1.965150,This
1,third row,-0.093593,0.741650,-0.854001,0.842118,0.218802,is
2,fourth row,-0.850493,0.800470,-2.008947,-1.187297,0.319317,the
3,fifth row,0.314050,-0.154098,-0.253282,-0.905114,-0.656227,row

In [66]:
df4.set_index('new name',inplace=True)
df4

               index  second col  third col  fourth col  fifth col  sixth col
new name
This       first row    0.019490   0.632669   -0.343938  -0.498723   1.965150
is         third row   -0.093593   0.741650   -0.854001   0.842118   0.218802
the       fourth row   -0.850493   0.800470   -2.008947  -1.187297   0.319317
row        fifth row    0.314050  -0.154098   -0.253282  -0.905114  -0.656227

In [67]:
df4.set_index('index',inplace=True)
df4

            second col  third col  fourth col  fifth col  sixth col
index
first row     0.019490   0.632669   -0.343938  -0.498723   1.965150
third row    -0.093593   0.741650   -0.854001   0.842118   0.218802
fourth row   -0.850493   0.800470   -2.008947  -1.187297   0.319317
fifth row     0.314050  -0.154098   -0.253282  -0.905114  -0.656227